[
  {
    "id": 16498,
    "title": "Attack on Titan",
    "description": "Several hundred years ago, humans were nearly exterminated by titans. Titans are typically several stories tall, seem to have no intelligence, devour human beings and, worst of all, seem to do it for the pleasure rather than as a food source.",
    "blaze": "Critically Acclaimed: 85%",
    "imagePath": "https://s4.anilist.co/file/anilistcdn/media/anime/cover/large/bx16498-buvcRTBx4NSm.jpg",
    "platform": "Crunchyroll"
  },
  {
    "id": 101922,
    "title": "Demon Slayer: Kimetsu no Yaiba",
    "description": "It is the Taisho Period in Japan. Tanjiro, a kindhearted boy who sells charcoal for a living, finds his family slaughtered by a demon.",
    "blaze": "Critically Acclaimed: 82%",
    "imagePath": "https://s4.anilist.co/file/anilistcdn/media/anime/cover/large/bx101922-WBsBl0ClmgYL.jpg",
    "platform": "Crunchyroll"
  },
  {
    "id": 113415,
    "title": "JUJUTSU KAISEN",
    "description": "A boy fights... for \"the right death.\"\n\nHardship, regret, shame: the negative feelings that humans feel become Curses that lurk in our everyday lives.",
    "blaze": "Critically Acclaimed: 84%",
    "imagePath": "https://s4.anilist.co/file/anilistcdn/media/anime/cover/large/bx113415-LHBAeoZDIsnF.jpg",
    "platform": "Crunchyroll"
  },
  {
    "id": 21459,
    "title": "My Hero Academia",
    "description": "What would the world be like if 80 percent of the population manifested extraordinary superpowers called “Quirks” at age four? Heroes and villains would be battling it out everywhere! Becoming a hero would mean learning to use your power, but where would you go to study? U.A. High's Hero Program of course! But what would you do if you were one of the 20 percent who were born Quirkless?\n\nMiddle school student Izuku Midoriya wants to be a hero more than anything, but he hasn't got an ounce of power in him.",
    "blaze": "Incredible fight scenes and animation.",
    "imagePath": "https://s4.anilist.co/file/anilistcdn/media/anime/cover/large/bx21459-nYh85uj2Fuwr.jpg",
    "platform": "Crunchyroll"
  },
  {
    "id": 11061,
    "title": "Hunter x Hunter (2011)",
    "description": "A new adaption of the manga of the same name by Togashi Yoshihiro.\nA Hunter is one who travels the world doing all sorts of dangerous tasks. From capturing criminals to searching deep within uncharted lands for any lost treasures.",
    "blaze": "Critically Acclaimed: 89%",
    "imagePath": "https://s4.anilist.co/file/anilistcdn/media/anime/cover/large/bx11061-y5gsT1hoHuHw.png",
    "platform": "Crunchyroll"
  },
  {
    "id": 21087,
    "title": "One-Punch Man",
    "description": "Saitama has a rather peculiar hobby, being a superhero, but despite his heroic deeds and superhuman abilities, a shadow looms over his life. He's become much too powerful, to the point that every opponent ends up defeated with a single punch.\n\nThe lack of challenge has driven him into a state of apathy, as he watches his life pass by having lost all enthusiasm, at least until he's unwillingly thrust in the role of being a mentor to the young and revenge-driven Genos.",
    "blaze": "Critically Acclaimed: 83%",
    "imagePath": "https://s4.anilist.co/file/anilistcdn/media/anime/cover/large/bx21087-B5DHjqZ3kW4b.jpg",
    "platform": "Crunchyroll"
  },
  {
    "id": 20605,
    "title": "Tokyo Ghoul",
    "description": "The suspense horror/dark fantasy story is set in Tokyo, which is haunted by mysterious \"ghouls\" who are devouring humans. People are gripped by the fear of these ghouls whose identities are masked in mystery.",
    "blaze": "Incredible fight scenes and animation.",
    "imagePath": "https://s4.anilist.co/file/anilistcdn/media/anime/cover/medium/b20605-k665mVkSug8D.jpg",
    "platform": "Crunchyroll"
  },
  {
    "id": 20958,
    "title": "Attack on Titan Season 2",
    "description": "Eren Jaeger swore to wipe out every last Titan, but in a battle for his life he wound up becoming the thing he hates most. With his new powers, he fights for humanity's freedom facing the monsters that threaten his home.",
    "blaze": "Critically Acclaimed: 84%",
    "imagePath": "https://s4.anilist.co/file/anilistcdn/media/anime/cover/large/bx20958-HuFJyr54Mmir.jpg",
    "platform": "Crunchyroll"
  },
  {
    "id": 21,
    "title": "ONE PIECE",
    "description": "Gold Roger was known as the Pirate King, the strongest and most infamous being to have sailed the Grand Line. The capture and death of Roger by the World Government brought a change throughout the world.",
    "blaze": "Critically Acclaimed: 88%",
    "imagePath": "https://s4.anilist.co/file/anilistcdn/media/anime/cover/large/bx21-ELSYx3yMPcKM.jpg",
    "platform": "Crunchyroll"
  },
  {
    "id": 5114,
    "title": "Fullmetal Alchemist: Brotherhood",
    "description": "\"In order for something to be obtained, something of equal value must be lost.\"\n\nAlchemy is bound by this Law of Equivalent Exchange—something the young brothers Edward and Alphonse Elric only realize after attempting human transmutation: the one forbidden act of alchemy. They pay a terrible price for their transgression—Edward loses his left leg, Alphonse his physical body.",
    "blaze": "Critically Acclaimed: 90%",
    "imagePath": "https://s4.anilist.co/file/anilistcdn/media/anime/cover/large/bx5114-nSWCgQlmOMtj.jpg",
    "platform": "Crunchyroll"
  },
  {
    "id": 20,
    "title": "Naruto",
    "description": "Naruto Uzumaki, a hyperactive and knuckle-headed ninja, lives in Konohagakure, the Hidden Leaf village. Moments prior to his birth, a huge demon known as the Kyuubi, the Nine-tailed Fox, attacked Konohagakure and wreaked havoc.",
    "blaze": "Incredible fight scenes and animation.",
    "imagePath": "https://s4.anilist.co/file/anilistcdn/media/anime/cover/large/bx20-dE6UHbFFg1A5.jpg",
    "platform": "Crunchyroll"
  },
  {
    "id": 11757,
    "title": "Sword Art Online",
    "description": "In the near future, a Virtual Reality Massive Multiplayer Online Role-Playing Game (VRMMORPG) called Sword Art Online has been released where players control their avatars with their bodies using a piece of technology called Nerve Gear. One day, players discover they cannot log out, as the game creator is holding them captive unless they reach the 100th floor of the game's tower and defeat the final boss.",
    "blaze": "Incredible fight scenes and animation.",
    "imagePath": "https://s4.anilist.co/file/anilistcdn/media/anime/cover/large/bx11757-SxYDUzdr9rh2.jpg",
    "platform": "Crunchyroll"
  },
  {
    "id": 99147,
    "title": "Attack on Titan Season 3",
    "description": "Eren and his companions in the 104th are assigned to the newly-formed Levi Squad, whose assignment is to keep Eren and Historia safe given Eren's newly-discovered power and Historia's knowledge and pedigree. Levi and Erwin have good reason to be concerned, because the priest of the Church that Hanji had hidden away was found tortured to death, making it clear that the Military Police are involved with the cover-up.",
    "blaze": "Critically Acclaimed: 85%",
    "imagePath": "https://s4.anilist.co/file/anilistcdn/media/anime/cover/large/bx99147-AiPDD8cwlCfi.jpg",
    "platform": "Crunchyroll"
  },
  {
    "id": 21856,
    "title": "My Hero Academia Season 2",
    "description": "Taking off right after the last episode of the first season. The school is temporarily closed due to security.",
    "blaze": "Incredible fight scenes and animation.",
    "imagePath": "https://s4.anilist.co/file/anilistcdn/media/anime/cover/large/bx21856-gutauxhWAwn6.png",
    "platform": "Crunchyroll"
  },
  {
    "id": 110277,
    "title": "Attack on Titan Final Season",
    "description": "It’s been four years since the Scout Regiment reached the shoreline, and the world looks different now. Things are heating up as the fate of the Scout Regiment—and the people of Paradis—are determined at last.",
    "blaze": "Critically Acclaimed: 86%",
    "imagePath": "https://s4.anilist.co/file/anilistcdn/media/anime/cover/large/bx110277-sKUNXAsWMNFw.jpg",
    "platform": "Crunchyroll"
  }
]