[
  {
    "id": 21087,
    "title": "One Punch Man",
    "description": "Saitama is a hero who can defeat any opponent with a single punch but suffers from existential boredom because no fight challenges him.",
    "whyNotCringe": "It’s a satire that mocks anime tropes instead of embracing them. Saitama is a humble, deadpan guy who worries about supermarket sales rather than giving edgy speeches.",
    "genre": "Action, Comedy, Parody",
    "dubbed": "Yes",
    "platform": "Netflix, Crunchyroll, Muse Asia (YouTube - periodically available)",
    "imagePath": "https://s4.anilist.co/file/anilistcdn/media/anime/cover/large/bx21087-B5DHjqZ3kW4b.jpg"
  },
  {
    "id": 21507,
    "title": "Mob Psycho 100",
    "description": "Mob is a socially awkward middle schooler with god-tier psychic powers. Instead of showing off, he suppresses his emotions to keep his powers in check and just wants to be a normal kid.",
    "whyNotCringe": "It prioritizes emotional maturity over \"coolness.\" Mob is kind and humble, and the show teaches that having powers doesn't make you a better person than others.",
    "genre": "Action, Supernatural, Slice of Life",
    "dubbed": "Yes",
    "platform": "Netflix, Crunchyroll",
    "imagePath": "https://s4.anilist.co/file/anilistcdn/media/anime/cover/large/bx21507-6YUSbh2m0N1p.jpg"
  },
  {
    "id": 170068,
    "title": "Frieren: Beyond Journey's End (Sousou no Frieren)",
    "description": "An elf mage who already defeated the Demon King decades ago retraces her journey. She is practically immortal and overwhelmingly powerful compared to modern mages.",
    "whyNotCringe": "Frieren destroys enemies with a bored expression because she has 1,000 years of experience. No shouting attack names, just pure, quiet competence.",
    "genre": "Adventure, Fantasy, Drama",
    "dubbed": "Yes",
    "platform": "Crunchyroll, Muse Asia (YouTube)",
    "imagePath": "https://s4.anilist.co/file/anilistcdn/media/anime/cover/large/bx170068-ijY3tCP8KoWP.jpg"
  },
  {
    "id": 777,
    "title": "Hellsing Ultimate",
    "description": "The vampire Alucard hunts other supernatural threats for the British government. He is a monster who hunts monsters.",
    "whyNotCringe": "It runs on \"adult cool\" rather than \"high school cool.\" It is dark, gory, and stylish with no forced romance or \"power of friendship.\"",
    "genre": "Horror, Action, Supernatural",
    "dubbed": "Yes",
    "platform": "Netflix",
    "imagePath": "https://s4.anilist.co/file/anilistcdn/media/anime/cover/large/bx777-F6547pSAR2Zd.jpg"
  },
  {
    "id": 112625,
    "title": "The Disastrous Life of Saiki K.",
    "description": "Kusuo Saiki has every psychic power imaginable but just wants to be left alone. He uses his powers to avoid social interaction.",
    "whyNotCringe": "Saiki is the ultimate \"straight man\" to the weird world around him. He finds his powers annoying, not awesome, which flips the usual trope on its head.",
    "genre": "Comedy, School, Slice of Life",
    "dubbed": "Yes (Netflix has \"Reawakened\" dubbed too)",
    "platform": "Netflix",
    "imagePath": "https://s4.anilist.co/file/anilistcdn/media/anime/cover/medium/b112625-5Qi2PEQqITCa.jpg"
  },
  {
    "id": 20832,
    "title": "Overlord",
    "description": "A gamer gets stuck in his avatar's body—a giant skeleton lich—and decides to conquer the world because he has nothing better to do.",
    "whyNotCringe": "The MC is the villain. He acts majestic to impress his minions but is internally panicking. It focuses on politics and world conquest rather than heroism.",
    "genre": "Isekai, Dark Fantasy",
    "dubbed": "Yes",
    "platform": "Netflix, Crunchyroll",
    "imagePath": "https://s4.anilist.co/file/anilistcdn/media/anime/cover/large/bx20832-vUNm5zrYWifc.jpg"
  },
  {
    "id": 151807,
    "title": "Solo Leveling",
    "description": "In a world where hunters fight monsters, the \"weakest hunter\" Sung Jinwoo gains a unique ability to level up like a video game character, rapidly becoming a god-tier entity.",
    "whyNotCringe": "It is the definition of \"Hype.\" Jinwoo changes from a weak boy to a cold, confident leader. The art and animation carry the \"cool factor\" without making him whine.",
    "genre": "Action, Fantasy",
    "dubbed": "Yes (Hindi & English)",
    "platform": "Crunchyroll",
    "imagePath": "https://s4.anilist.co/file/anilistcdn/media/anime/cover/large/bx151807-it355ZgzquUd.png"
  },
  {
    "id": 144991,
    "title": "Parasyte: The Maxim (Kiseijuu)",
    "description": "Shinichi's right hand is eaten by an alien parasite. They form an uneasy alliance to survive as other parasites begin slaughtering humans.",
    "whyNotCringe": "Shinichi starts weak but becomes ruthlessly efficient and cold due to trauma/physiological changes. It explores what it means to be human, not just fighting.",
    "genre": "Sci-Fi, Horror, Psychological",
    "dubbed": "Yes",
    "platform": "Netflix, Crunchyroll",
    "imagePath": "https://s4.anilist.co/file/anilistcdn/media/anime/cover/large/bx144991-uzyJgJlkrl2L.png"
  },
  {
    "id": 151801,
    "title": "Mashle: Magic and Muscles",
    "description": "In a world where magic is everything, Mash is born without it. He compensates by working out so hard he can slap fireballs away and lift weights with his feet.",
    "whyNotCringe": "It’s basically \"What if Harry Potter was Saitama?\" It’s a comedy that mocks the seriousness of \"chosen one\" wizards.",
    "genre": "Comedy, Action, Fantasy",
    "dubbed": "Yes",
    "platform": "Crunchyroll, Amazon Prime Video",
    "imagePath": "https://s4.anilist.co/file/anilistcdn/media/anime/cover/large/bx151801-XxVf22Le6C8o.png"
  },
  {
    "id": 120377,
    "title": "Cyberpunk: Edgerunners",
    "description": "A street kid named David Martinez installs a powerful military-grade spinal implant to survive in a dystopian city obsessed with tech and body modification.",
    "whyNotCringe": "It’s gritty, tragic, and fast-paced. There is no plot armor here; using too much power literally drives you insane. It feels like a high-stakes crime thriller.",
    "genre": "Sci-Fi, Action, Cyberpunk",
    "dubbed": "Yes",
    "platform": "Netflix",
    "imagePath": "https://s4.anilist.co/file/anilistcdn/media/anime/cover/large/bx120377-ayZPoxiWt4Li.jpg"
  },
  {
    "id": 101348,
    "title": "Vinland Saga (Season 1)",
    "description": "Thorfinn is a young Viking warrior seeking revenge. While realistic, his speed and dual-dagger skills in Season 1 are borderline superhuman compared to normal soldiers.",
    "whyNotCringe": "It is a historical epic. The \"coolness\" comes from brutal, realistic warfare and politics, not magic or superpowers. It is very mature and grounded.",
    "genre": "Historical, Action, Drama",
    "dubbed": "Yes",
    "platform": "Netflix, Crunchyroll",
    "imagePath": "https://s4.anilist.co/file/anilistcdn/media/anime/cover/large/bx101348-2fhDFPCuMNiz.jpg"
  },
  {
    "id": 128893,
    "title": "Hell's Paradise (Jigokuraku)",
    "description": "Gabimaru the Hollow, an elite ninja assassin, is sent to a deadly island to find the Elixir of Life. He is so skilled that execution methods fail to kill him.",
    "whyNotCringe": "The MC is married and faithful (rare for anime). He fights because he wants to go home to his wife. The setting is creepy and beautiful, avoiding standard shonen tropes.",
    "genre": "Action, Dark Fantasy",
    "dubbed": "Yes",
    "platform": "Netflix",
    "imagePath": "https://s4.anilist.co/file/anilistcdn/media/anime/cover/large/bx128893-Gc2t8b8M0mVu.jpg"
  },
  {
    "id": 101347,
    "title": "Dororo",
    "description": "Hyakkimaru was born without limbs, eyes, or skin due to a demon pact. He uses prosthetic blades to hunt demons, regaining his body parts one by one.",
    "whyNotCringe": "The MC is silent (literally cannot speak for much of it). It’s a somber, atmospheric journey through feudal Japan. He is an absolute machine in combat but a tragic figure.",
    "genre": "Historical, Supernatural, Action",
    "dubbed": "Yes",
    "platform": "Amazon Prime Video",
    "imagePath": "https://s4.anilist.co/file/anilistcdn/media/anime/cover/large/bx101347-TGaDwEYqLfm1.jpg"
  },
  {
    "id": 205,
    "title": "Samurai Champloo",
    "description": "Two samurai with opposing styles—Mugen (breakdancing wild style) and Jin (disciplined traditional style)—escort a girl across Japan. Both are nearly unbeatable swordsmen.",
    "whyNotCringe": "It oozes style. The hip-hop soundtrack and unique direction make it \"cool\" rather than \"edgy.\" The characters are flawed adults, not whiny teens.",
    "genre": "Action, Adventure, Chanbara",
    "dubbed": "Yes",
    "platform": "Crunchyroll",
    "imagePath": "https://s4.anilist.co/file/anilistcdn/media/anime/cover/large/bx205-7tHVFu6dPBm9.png"
  },
  {
    "id": 98659,
    "title": "Classroom of the Elite",
    "description": "Ayanokouji enters a prestigious school where students are ranked by merit. He looks boring and average but is secretly a genius manipulator who controls the class from the shadows.",
    "whyNotCringe": "This is \"Intellectual OP.\" He doesn't fight with fists often; he fights with his brain. He is a sociopathic anti-hero who treats people like tools, which is refreshing if you dislike \"power of friendship.\"",
    "genre": "Psychological, School, Thriller",
    "dubbed": "Yes",
    "platform": "Netflix, Crunchyroll, Muse Asia (YouTube",
    "imagePath": "https://s4.anilist.co/file/anilistcdn/media/anime/cover/large/bx98659-WNyPLIZDpGGY.jpg"
  }
]